public class Main {
    public static void main(String[] args) {
        int ticketPrice = 120;
        int ticket = 20;
        int miles = ticketPrice / ticket;


        System.out.println("Вам начислено " + miles + " миль");
    }
}

// Объявляете переменные для входных данных и
// параметров программы: одну для хранения
// стоимости билета, другую для хранения количества
// рублей для одной бонусной мили

// Рассчитываете количество бонусных миль, используя
// значения заведённых переменных. Ответ сохраняете в
// новую переменную и выводите на экран
